app/Controllers/Window.php

SELECT *
FROM `windows`
WHERE `windows`.`id` = '1'
SELECT *
FROM `service_records`
WHERE `window_id` = '1'
AND `ticket_number` = 'BREQS-004'
AND `service_type` = 'completed'
 LIMIT 1
---
    public function getData($windowId)
    {
        $window = $this->windowModel->find($windowId);
        if (!$window) {
            return $this->response->setJSON(['success' => false]);
        }

        $nowServing = $this->queueModel->getServingByWindow($windowId);
        $waitingList = $this->queueModel->getWaitingByWindow($windowId);
        $skippedList = $this->queueModel->getSkippedByWindow($windowId);
        $completedList = $this->queueModel->getCompletedByWindow($windowId);

        // Check if current serving was from completed list
        $isServingFromCompleted = false;
        if ($nowServing) {
            // Check if this ticket has a service record as 'completed' before being called again
            $completedRecord = $this->serviceRecordModel
                ->where('window_id', $windowId)
                ->where('ticket_number', $nowServing['ticket_number'])
                ->where('service_type', 'completed')
                ->first();