app/Controllers/Window.php

    public function getData($windowId)
    {
        $window = $this->windowModel->find($windowId);
---
SELECT *
FROM `windows`
WHERE `windows`.`id` = '2'