app/Models/CustomerRecordsModel.php

    public function getCustomerRecords($windowId = null, $startDate = null, $endDate = null)
    {
        $builder = $this->select('customer_records.*, windows.window_name, windows.window_number')
                        ->join('windows', 'windows.id = customer_records.window_id');

        if ($windowId) {
            $builder->where('customer_records.window_id', $windowId);
        }

        if ($startDate && $endDate) {
            $builder->where('customer_records.created_at >=', $startDate . ' 00:00:00');
            $builder->where('customer_records.created_at <=', $endDate . ' 23:59:59');
        }

        return $builder->orderBy('customer_records.created_at', 'DESC')
                        ->findAll();
---
SELECT `customer_records`.*, `windows`.`window_name`, `windows`.`window_number`
FROM `customer_records`
JOIN `windows` ON `windows`.`id` = `customer_records`.`window_id`
WHERE `customer_records`.`created_at` >= '2026-03-19 00:00:00'
AND `customer_records`.`created_at` <= '2026-03-19 23:59:59'
ORDER BY `customer_records`.`created_at` DESC