app/Models/QueueModel.php

SELECT *
FROM `queues`
WHERE `window_id` = '1'
AND `status` = 'waiting'
ORDER BY `queue_number` ASC
---
    public function getWaitingByWindow($windowId)
    {
        return $this->where('window_id', $windowId)
                    ->where('status', 'waiting')
                    ->orderBy('queue_number', 'ASC')
                    ->findAll();

SELECT *
FROM `queues`
WHERE `window_id` = '1'
AND `status` = 'serving'
 LIMIT 1
---
    public function getServingByWindow($windowId)
    {
        return $this->where('window_id', $windowId)
                    ->where('status', 'serving')
                    ->first();

SELECT COUNT(*) AS `numrows`
FROM `queues`
WHERE `window_id` = '1'
AND `status` = 'waiting'
---
    public function getWaitingCount($windowId)
    {
        return $this->where('window_id', $windowId)
                    ->where('status', 'waiting')
                    ->countAllResults();

SELECT *
FROM `queues`
WHERE `window_id` = '1'
AND `status` = 'skipped'
ORDER BY `completed_at` DESC
---
    public function getSkippedByWindow($windowId)
    {
        return $this->where('window_id', $windowId)
                    ->where('status', 'skipped')
                    ->orderBy('completed_at', 'DESC')
                    ->findAll();

SELECT *
FROM `queues`
WHERE `window_id` = '1'
AND `status` = 'completed'
ORDER BY `completed_at` DESC
---
    public function getCompletedByWindow($windowId)
    {
        return $this->where('window_id', $windowId)
                    ->where('status', 'completed')
                    ->orderBy('completed_at', 'DESC')
                    ->findAll();