app/Models/WindowModel.php

SELECT *
FROM `windows`
---
    public function getAllWindows()
    {
        return $this->findAll();

SELECT *
FROM `windows`
WHERE `window_number` = '1'
 LIMIT 1
---
    public function getWindowByNumber($number)
    {
        return $this->where('window_number', $number)->first();